# Análise Exploratória dos Dados (EDA)

In [2]:
#Importando bibliotecas
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

import warnings
warnings.filterwarnings('ignore')

In [3]:
#Importar dataframe de treino e de teste
data_treino = pd.read_csv('titanic/train.csv')
data_teste = pd.read_csv('titanic/test.csv')

In [4]:
#Traduzir colunas
data_treino.columns = ['IdPassageiro', 'Sobreviveu',
                       'Classe', 'Nome', 'Sexo', 'Idade',
                       'IrmaosConjuge','PaisFilhos', 'Bilhete',
                       'Tarifa', 'Cabine', 'Embarque']

In [5]:
data_teste.columns = ['IdPassageiro', 'Classe', 'Nome',
                      'Sexo', 'Idade','IrmaosConjuge',
                      'PaisFilhos', 'Bilhete', 'Tarifa',
                      'Cabine', 'Embarque']

In [6]:
#Definir o IdPassageiro como índice
data_treino.set_index('IdPassageiro', inplace=True)
data_teste.set_index('IdPassageiro', inplace=True)

In [7]:
data_treino.shape, data_teste.shape

((891, 11), (418, 10))

In [8]:
#Concatenar dataframes
data = pd.concat([data_treino, data_teste],sort=True)

In [9]:
data['Sexo'] = data['Sexo'].map({'male': 'homem',
                                 'female': 'mulher'})

In [10]:
data.head()

,Bilhete,Cabine,Classe,Embarque,Idade,IrmaosConjuge,Nome,PaisFilhos,Sexo,Sobreviveu,Tarifa
IdPassageiro,,,,,,,,,,,
1,A/5 21171,NaN,3,S,22.0,1,"Braund, Mr. Owen Harris",0,homem,0.0,7.2500
2,PC 17599,C85,1,C,38.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,mulher,1.0,71.2833
3,STON/O2. 3101282,NaN,3,S,26.0,0,"Heikkinen, Miss. Laina",0,mulher,1.0,7.9250
4,113803,C123,1,S,35.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,mulher,1.0,53.1000
5,373450,NaN,3,S,35.0,0,"Allen, Mr. William Henry",0,homem,0.0,8.0500

## Resumo da Análise Exploratória
### Parâmetros Categóricos
* Nominais
 * Sexo
 * Embarque
 * Sobreviveu
 
* Ordinais
 * Classe
 

### Parâmetros Númericos
* Contínuos
 * Idade
 * Tarifa
 
* Discretos
 * IrmaosConjuge
 * PaisFilhos
 
### Parâmetros Alfanuméricos
* Bilhete

# Engenharia de Recursos

In [11]:
data.isnull().sum()

Bilhete             0
Cabine           1014
Classe              0
Embarque            2
Idade             263
IrmaosConjuge       0
Nome                0
PaisFilhos          0
Sexo                0
Sobreviveu        418
Tarifa              1
dtype: int64

In [13]:
#Preencher coluna Embarque com a moda
moda_embarque = data['Embarque'].mode()[0]
data['Embarque'].fillna(moda_embarque, inplace=True)

In [14]:
#Informações gerais
data.describe()

,Classe,Idade,IrmaosConjuge,PaisFilhos,Sobreviveu,Tarifa
count,1309.000000,1046.000000,1309.000000,1309.000000,891.000000,1308.000000
mean,2.294882,29.881138,0.498854,0.385027,0.383838,33.295479
std,0.837836,14.413493,1.041658,0.865560,0.486592,51.758668
min,1.000000,0.170000,0.000000,0.000000,0.000000,0.000000
25%,2.000000,21.000000,0.000000,0.000000,0.000000,7.895800
50%,3.000000,28.000000,0.000000,0.000000,0.000000,14.454200
75%,3.000000,39.000000,1.000000,0.000000,1.000000,31.275000
max,3.000000,80.000000,8.000000,9.000000,1.000000,512.329200

In [16]:
data.describe(include=['O'])

         Bilhete       Cabine Embarque              Nome   Sexo
count       1309          295     1309              1309   1309
unique       929          186        3              1307      2
top     CA. 2343  C23 C25 C27        S  Kelly, Mr. James  homem
freq          11            6      916                 2    843